[
    {
        "name": "Admission",
        "description":
            {"Overview":
                "With outstanding research-led and application oriented education, we consistently compete with top most Universities and Institutions.By learning through exposure to research and industrial needs, our students gain first hand work experience with valuable skills. This unique combination of knowledge and experience enable our students to become a successful member of the workplace immediately upon completing their course."
            ,"Admissions at our Regional Campus":
                "At Anna University Regional Campus, Coimbatore, we have an active Admission Office which makes the admission procedure effortless and speedy. Sophisticated software is used for admission procedure which ensures one time data entry as well as immediate issue of identity card, Bonafide Certificate and Fee Structure to the students. We offer individual attention to students and their parents. We have a team of professionals available all year-round to answer your questions and provide further guidance regarding admissions. Our office hours are Monday-Friday, 9.00 a.m.-5.00 p.m."
            }
                    ,
        "courses_offered":"We offer UG and a range of industry-aligned PG courses in Engineering, Technology and Management science. Our Regional Campus offers 5 UG and 3 PG courses in Engineering and Technology in Full time mode. We also offer one Post graduate course in Master of Business Administration (M.B.A.).",
        
        "eligibility_criteria": {
              "Under Graduate Programmes": "Admissions to all U.G. courses (BE/B.Tech.) are made by Government of Tamil Nadu through TNEA (Tamil Nadu Engineering Admissions) administered by Anna University, Chennai. For further details visit at www.annauniv.edu.",
              "Post Graduate Programmes": "Admissions to all P.G. courses (M.E., M.Tech., MBA, etc.,) are made by Government of Tamil Nadu through TANCET (Tamil Nadu Common Entrance Test) administered by Anna University, Chennai. Further details are available at www.annauniv.edu",
              "Research Programmes": "Admissions to Ph.D. programmes are made by Centre for Research, Anna University, Chennai twice a year. Interested research scholars are expected to get in touch with the recognized supervisors and obtain their consent for being a supervisor to the applicant. The details regarding the entrance tests for Ph.D. admission and other rules and regulations are available at www.annaunty.edu/research."
            },
        "contact_us":{
            "image":"",
            "Admission Co-ordinator":
            "Dr.M.Rathinasamy, Deputy Manager(Finance) Anna University Regional Campus, Maruthamalai Main Road, Coimbatore(Dt). Pin-641 046. Phone: 0422 2984009,0422 2984011 E-Mail: aurccadmissions@gmail.com."
        }
          
          
        
    }
]   